[
  { "title": "PizzCOIN ", "description": "PizzCOIN is a cryptocurrency website where users can browse various cryptocurrencies, check their value in different currencies, view detailed information about each cryptocurrency, and analyze charts displaying price trends. The website was created as a learning project to improve my skills in fetching API data using Axios, sorting and searching through data, and creating dynamic tables. The project utilizes React for building the user interface, React Router Dom for managing routes, Axios for handling API requests, a cryptocurrency API for fetching data, and TailwindCSS for styling.", "linkToGithub": "https://github.com/Kamil-Adamowski/PizzCOIN-cryptocurrency-website", "id": 1},
  { "title": "Chat App", "description": "Chat App is an application that allows users to register, log in, and communicate with others in real time. It was created to help me learn and improve my skills in technologies such as Redux, Firebase, and Styled-Components. Through developing this app, I gained hands-on experience in using React for building the user interface, React Router Dom for route management, Redux for state management, Firebase for user authentication and data storage, and Styled-Components for styling the components.", "linkToGithub": "https://github.com/Kamil-Adamowski/Chat-app", "id": 2},
  { "title": "ClickMe", "description": "ClickMeApp is a simple clicker game created for fun. The player earns points by clicking a button, and those points can be spent on purchasing an autoclick feature. The game also includes achievements and a basic user interface to enhance the experience.The app was built using React for the interactive interface, React Router Dom for managing routes, and CSS for styling.", "linkToGithub": "https://github.com/Kamil-Adamowski/ClickMeApp", "id": 3},
  { "title": "Task App", "description": "TaskAPP is an application developed for Askot Kraków, designed to coordinate tasks and projects within the company. Each employee has specific roles that allow them to manage projects, including adding, editing, and deleting tasks, assigning employees to tasks, and managing deadlines. Additionally, it features a dedicated section for e-commerce employees, enabling them to edit images so that they are ready for upload to the online store, fully compliant with SEO and company policies. The app was built using React, React Router Dom, Redux, Firebase, and SCSS for styling.", "linkToGithub": "#", "id": 4},
  { "title": "Portfolio", "description": "My portfolio website serves as a showcase of my skills and projects as a frontend developer. It was designed to provide a clean, user-friendly experience that highlights my expertise in modern web development. The site includes sections for featured projects. Each project is presented with a description, and links to repositories, offering a comprehensive view of my work. It was built using modern technologies like React, TypeScript, React Router for navigation, Tailwind CSS for styling, and Jest for testing.", "linkToGithub": "#", "id": 5}
]